#include <stdio.h>

int main(void) {

	// 형 변환 연산자
	/*
		자바에서도 똑같은 문법 
	*/

	int a = 20, b = 3;
	double res;

	
	res = ((double)a / (double)b);
	printf("형 변환 연산자\n");
	printf("a = %d, b = %d\n", a, b);
	printf("a / b 의 결과 : %.1lf\n", res);

	a = (int)res;
	printf("(int) %.1lf의 결과 : %d\n\n", res, a);
	/*
		자동 형 변환

		대입 연산은 메모리에 값을 저장하므로 무조건 좌항의 변수값에 맞게 저장된다. 
		자동 형 변화는 형태가 다른 데이터를 자유롭게 연산할 수 있도록 도와주지만 
		예상치 못한 값의 변형이 생길 수 있으니 가능하면 피연산자의 형태를 같게 맞춰 사용하는 편이 좋다. 
	*/

	//sizeof 연산자 
	/*
		sizeof 연산자는 피연산자를 하나만 사용할 수 있으며 피연산자의 크기를 바이트 단위로 계산해서
		알려준다. sizeof(피연산자) 로 표기하며 피연산자의 대상은 변수,상수,수식, 자료형 등이 될 수 있다. 
	*/

	a = 10;
	double c = 3.4;
	printf("sizeof 연산자\n");
	printf("int형 변수의 크기 : %d\n", sizeof(a));
	printf("double형 변수의 크기 : %d\n", sizeof(c));
	printf("정수형 상수의 크기 : %d\n", sizeof(10));
	printf("수식의 결괏값의 크기 : %d\n", sizeof(1.5+3.4));
	printf("char 자료형의 크기 : %d\n\n", sizeof(char));

	/*
	*	복합 대입 연산자는 연산이 되는 공간과 저장되는 공간이 다르다 
	*/
	a = 20; b = 10;
	int res1 = 2;

	res1 *= b + 10;
	printf("복합 대입 연산자\n");
	printf("b = %d\n", b);
	printf("res1 *= b+10 의 연산 결과 : %d\n\n", res1);

	// 콤마 연산자  
	/*
		콤마 연산자는 한 번에 여러 개의 수식을 차례로 자열해야 할 때 사용
		콤마 연산자는 왼쪽부터 오른쪽으로 연산을 수행 가장 오른쪽의 피연산자가 최종 결과값이 된다. 
	*/

	a = 10, b = 20;
	
	res1 = (++a, ++b); 
	// 차례로 연산이 수행되며 결과적으로 res1 에 저장되는 값은 증가된 b의 값임
	printf("a : %d, b = %d\n", a, b);
	printf("res1:%d\n", res1);
	/*
		콤마 연산자는 대입 연산자보다 우선순위가 낮은 유일한 연산자이다 
		따라서 대입 연산자와 함께 사용할때는 반드시 괄호가 필요하다. 
	*/

	/*
		연산자 우선순위

		단항 > 이항 > 삼항 순으로 연산
		산술 > 비트 이동 연산자 > 관계 > 논리 연산 순  
	*/


		
	return 0;
}