#include <stdio.h>

/**
	C프로그램은 함수로 만들어지며 함수는 일정한 기능을 수행하는 코드 단위를 말한다.
	큰 프로그램수록 함수를 많이 사용하지만 간단한 프로그램의 경우 main 함수 하나만으로 만들기도 한다.

*/

/**
	프로그램과 main 함수 구조

	main함수는 머리와 몸통으로 구성된다.

	머리는 함수 원형이라고 하며 함수의 이름과 필요한 데이터 등을 표시한다.

	함수에서 실행할 일은 몸통의 중괄호 안에 작성한다.
	마지막에는 return 0; 을 넣어서 프로그램을 종료한다.

	
*/

int main(void) {

	printf("Be Happy\n");
	printf("12345678901234567890\n");
	printf("My\tfriend\n");
	printf("Goot\bd\tchance\n"); // Goot을 출력하고 한 칸 왼쪽으로 이동(\b) 후 t를 d로 바꾸고 탭 위치로
	// 이동한(\t) 후에 chance를 출력하고 줄을 바꿈
	printf("Cow\rW\a\n"); // 맨 앞으로 이동(\r) 해 C를 W로 바꾸고 벨소리(\a)를 내고 줄을 바꿈(\n)

	return 0;
}

/*
	\b : 백스페이스 : 한칸 왼쪽으로 이동 
	\r : 캐리지 리턴 : 맨 앞으로 이동 
	\a : 알럿 경보 : 벨소리
*/